#+begin_src python :tangle yes :session pybtc :results silent

from pprint import pprint

# local imports
from bitcointools.hashes import hash256
from bitcointools.helpers import parse_varint, reverse_bytes
from bitcointools.rpc import make_rpc_call
from bitcointools.segwit import sanitize_segwit

def get_block(blockhash, verbosity=1):
    return make_rpc_call("getblock", [blockhash, verbosity])

def getrawtransaction(txid: str, verbosity=1, blockhash=None):
    "Pull transaction from blockchain (default: localhost)"
    return make_rpc_call("getrawtransaction", [txid, verbosity])

def decoderawtransaction(hex: str, is_witness=False):
    "Decode a transaction or witness from hex"
    return make_rpc_call("decoderawtransaction", [hex, is_witness])

def get_txid(serialized_tx):
    if serialized_tx[8:12] == '0001':  # segwit
        serialized_tx = sanitize_segwit(serialized_tx)
    hash = hash256(bytes.fromhex(serialized_tx)).hex()
    return reverse_bytes(hash)

tx_keys = ['txid', 'hash', 'version', 'size', 'vsize', 'weight', 'locktime', 'vin', 'vout', 'hex', 'blockhash', 'confirmations', 'time', 'blocktime']
#+end_src

* Coinbase
#+begin_src python :tangle yes :session pybtc :results replace output
genesis = get_block("000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f", 3)
plus_one = get_block("00000000839a8e6886ab5951d76f411475428afc90947ee320161bbf18eb6048", 3)

pprint(get_block("000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f"))
#+end_src

#+RESULTS:
#+begin_example
{'bits': '1d00ffff',
 'chainwork': '0000000000000000000000000000000000000000000000000000000100010001',
 'confirmations': 903193,
 'difficulty': 1,
 'hash': '000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f',
 'height': 0,
 'mediantime': 1231006505,
 'merkleroot': '4a5e1e4baab89f3a32518a88c31bc87f618f76673e2cc77ab2127b7afdeda33b',
 'nTx': 1,
 'nextblockhash': '00000000839a8e6886ab5951d76f411475428afc90947ee320161bbf18eb6048',
 'nonce': 2083236893,
 'size': 285,
 'strippedsize': 285,
 'target': '0000000000000000000268160000000000000000000000000000000000000000',
 'time': 1231006505,
 'tx': ['4a5e1e4baab89f3a32518a88c31bc87f618f76673e2cc77ab2127b7afdeda33b'],
 'version': 1,
 'versionHex': '00000001',
 'weight': 1140}
#+end_example


* Pay-to-Public-Key (P2PK)
#+begin_src python :tangle yes :session pybtc :results silent


#+end_src


* Segwit
#+begin_src python :tangle yes :results silent :session pybtc

#+end_src

* Pay-to-Taproot (P2TR)
#+begin_src python :tangle yes :session pybtc :results silent

# filter on type(witness_v1_taproot) and is_spent(true)

# { 'txhash': "",
#     'desc': "" }

# taken from, https://bitcoin.stackexchange.com/questions/110995/how-can-i-find-samples-for-p2tr-transactions-on-mainnet

p2tr_txs = [ { 'txid': "33e794d097969002ee05d336686fc03c9e15a597c1b9827669460fac98799036",
               'desc': "first P2TR"},

             { 'txid': "37777defed8717c581b4c0509329550e344bdc14ac38f71fc050096887e535c8",
               'desc': "First TX with both a P2TR script-path and a P2TR key-path input"},

             { 'txid': "83c8e0289fecf93b5a284705396f5a652d9886cbd26236b0d647655ad8a37d82",
               'desc': "First multiple P2TR key-path inputs"},

             { 'txid': "905ecdf95a84804b192f4dc221cfed4d77959b81ed66013a7e41a6e61e7ed530",
               'desc': "First script-path 2-of-2 multisig spend" },

             { 'txid': "2eb8dbaa346d4be4e82fe444c2f0be00654d8cfd8c4a9a61b11aeaab8c00b272",
               'desc': "First use of OP_CHECKSIGADD" } ]

#+end_src

#+begin_src python :tangle yes :session pybtc :results replace output

for t in p2tr_txs:
    t['raw'] = getrawtransaction(t['txid'], False)
    t['unpacked'] = getrawtransaction(t['txid'])

p2tr_txs[3]['parent'] = getrawtransaction("5b79f5d6039c188613342eb13961dd7d1e1a0f90023d3eaed25fc85a29201bb4")

pprint(p2tr_txs[3]['raw'])
#+end_src

#+RESULTS:
: '02000000000101b41b20295ac85fd2ae3e3d02900f1a1e7ddd6139b12e341386189c03d6f5795b0000000000fdffffff0100000000000000003c6a3a546878205361746f7368692120e2889e2f32316d696c20466972737420546170726f6f74206d756c7469736967207370656e64202d426974476f044123b1d4ff27b16af4b0fcb9672df671701a1a7f5a6bb7352b051f461edbc614aa6068b3e5313a174f90f3d95dc4e06f69bebd9cf5a3098fde034b01e69e8e788901400fd4a0d3f36a1f1074cb15838a48f572dc18d412d0f0f0fc1eeda9fa4820c942abb77e4d1a3c2b99ccf4ad29d9189e6e04a017fe611748464449f681bc38cf394420febe583fa77e49089f89b78fa8c116710715d6e40cc5f5a075ef1681550dd3c4ad20d0fa46cb883e940ac3dc5421f05b03859972639f51ed2eccbf3dc5a62e2e1b15ac41c02e44c9e47eaeb4bb313adecd11012dfad435cd72ce71f525329f24d75c5b9432774e148e9209baf3f1656a46986d5f38ddf4e20912c6ac28f48d6bf747469fb100000000'

#+begin_src python :tangle yes :session pybtc :results replace output

print(list(p2tr_txs[3]['unpacked'].keys()))
#+end_src

#+RESULTS:
: ['txid', 'hash', 'version', 'size', 'vsize', 'weight', 'locktime', 'vin', 'vout', 'hex', 'blockhash', 'confirmations', 'time', 'blocktime']

#+begin_src python :tangle yes :session pybtc :results replace output

pprint(p2tr_txs[3]['unpacked'])
#+end_src

#+RESULTS:
#+begin_example
{'blockhash': '00000000000000000001f9ee4f69cbc75ce61db5178175c2ad021fe1df5bad8f',
 'blocktime': 1636868413,
 'confirmations': 193513,
 'hash': '526a41ff7182577e3eff0af07b399d310e4d33def08eb847322d818f80cd0738',
 'hex': '02000000000101b41b20295ac85fd2ae3e3d02900f1a1e7ddd6139b12e341386189c03d6f5795b0000000000fdffffff0100000000000000003c6a3a546878205361746f7368692120e2889e2f32316d696c20466972737420546170726f6f74206d756c7469736967207370656e64202d426974476f044123b1d4ff27b16af4b0fcb9672df671701a1a7f5a6bb7352b051f461edbc614aa6068b3e5313a174f90f3d95dc4e06f69bebd9cf5a3098fde034b01e69e8e788901400fd4a0d3f36a1f1074cb15838a48f572dc18d412d0f0f0fc1eeda9fa4820c942abb77e4d1a3c2b99ccf4ad29d9189e6e04a017fe611748464449f681bc38cf394420febe583fa77e49089f89b78fa8c116710715d6e40cc5f5a075ef1681550dd3c4ad20d0fa46cb883e940ac3dc5421f05b03859972639f51ed2eccbf3dc5a62e2e1b15ac41c02e44c9e47eaeb4bb313adecd11012dfad435cd72ce71f525329f24d75c5b9432774e148e9209baf3f1656a46986d5f38ddf4e20912c6ac28f48d6bf747469fb100000000',
 'locktime': 0,
 'size': 389,
 'time': 1636868413,
 'txid': '905ecdf95a84804b192f4dc221cfed4d77959b81ed66013a7e41a6e61e7ed530',
 'version': 2,
 'vin': [{'scriptSig': {'asm': '', 'hex': ''},
          'sequence': 4294967293,
          'txid': '5b79f5d6039c188613342eb13961dd7d1e1a0f90023d3eaed25fc85a29201bb4',
          'txinwitness': ['23b1d4ff27b16af4b0fcb9672df671701a1a7f5a6bb7352b051f461edbc614aa6068b3e5313a174f90f3d95dc4e06f69bebd9cf5a3098fde034b01e69e8e788901',
                          '0fd4a0d3f36a1f1074cb15838a48f572dc18d412d0f0f0fc1eeda9fa4820c942abb77e4d1a3c2b99ccf4ad29d9189e6e04a017fe611748464449f681bc38cf39',
                          '20febe583fa77e49089f89b78fa8c116710715d6e40cc5f5a075ef1681550dd3c4ad20d0fa46cb883e940ac3dc5421f05b03859972639f51ed2eccbf3dc5a62e2e1b15ac',
                          'c02e44c9e47eaeb4bb313adecd11012dfad435cd72ce71f525329f24d75c5b9432774e148e9209baf3f1656a46986d5f38ddf4e20912c6ac28f48d6bf747469fb1'],
          'vout': 0}],
 'vout': [{'n': 0,
           'scriptPubKey': {'asm': 'OP_RETURN '
                                   '546878205361746f7368692120e2889e2f32316d696c20466972737420546170726f6f74206d756c7469736967207370656e64202d426974476f',
                            'desc': 'raw(6a3a546878205361746f7368692120e2889e2f32316d696c20466972737420546170726f6f74206d756c7469736967207370656e64202d426974476f)#t8p0kp76',
                            'hex': '6a3a546878205361746f7368692120e2889e2f32316d696c20466972737420546170726f6f74206d756c7469736967207370656e64202d426974476f',
                            'type': 'nulldata'},
           'value': 0.0}],
 'vsize': 188,
 'weight': 749}
#+end_example

#+begin_src python :tangle yes :session pybtc :results replace output
pprint(p2tr_txs[3]['unpacked']['vin'])

txinwitness = p2tr_txs[3]['unpacked']['vin'][0]['txinwitness']
#+end_src

#+RESULTS:
: [{'scriptSig': {'asm': '', 'hex': ''},
:   'sequence': 4294967293,
:   'txid': '5b79f5d6039c188613342eb13961dd7d1e1a0f90023d3eaed25fc85a29201bb4',
:   'txinwitness': ['23b1d4ff27b16af4b0fcb9672df671701a1a7f5a6bb7352b051f461edbc614aa6068b3e5313a174f90f3d95dc4e06f69bebd9cf5a3098fde034b01e69e8e788901',
:                   '0fd4a0d3f36a1f1074cb15838a48f572dc18d412d0f0f0fc1eeda9fa4820c942abb77e4d1a3c2b99ccf4ad29d9189e6e04a017fe611748464449f681bc38cf39',
:                   '20febe583fa77e49089f89b78fa8c116710715d6e40cc5f5a075ef1681550dd3c4ad20d0fa46cb883e940ac3dc5421f05b03859972639f51ed2eccbf3dc5a62e2e1b15ac',
:                   'c02e44c9e47eaeb4bb313adecd11012dfad435cd72ce71f525329f24d75c5b9432774e148e9209baf3f1656a46986d5f38ddf4e20912c6ac28f48d6bf747469fb1'],
:   'vout': 0}]

#+begin_src python :tangle yes :session pybtc :results replace output
scriptPubKey = p2tr_txs[3]['unpacked']['vout'][0]['scriptPubKey']
value = p2tr_txs[3]['unpacked']['vout'][0]['value']

pprint(p2tr_txs[3]['unpacked']['vout'])
#+end_src

#+RESULTS:
: [{'n': 0,
:   'scriptPubKey': {'asm': 'OP_RETURN '
:                           '546878205361746f7368692120e2889e2f32316d696c20466972737420546170726f6f74206d756c7469736967207370656e64202d426974476f',
:                    'desc': 'raw(6a3a546878205361746f7368692120e2889e2f32316d696c20466972737420546170726f6f74206d756c7469736967207370656e64202d426974476f)#t8p0kp76',
:                    'hex': '6a3a546878205361746f7368692120e2889e2f32316d696c20466972737420546170726f6f74206d756c7469736967207370656e64202d426974476f',
:                    'type': 'nulldata'},
:   'value': 0.0}]

#+begin_src python :tangle yes :session pybtc :results replace output
out_3 = getrawtransaction("80975cddebaa93aa21a6477c0d050685d6820fa1068a2731db0f39b535cbd369")['vin'][3]
witness = getrawtransaction("80975cddebaa93aa21a6477c0d050685d6820fa1068a2731db0f39b535cbd369")['vin'][3]['txinwitness']

pprint(out_3)
#+end_src

#+RESULTS:
: {'scriptSig': {'asm': '002044c55c1da36a576217259c3bc21b0c3943f7eb3ff4e3c381d9fd3502434b9e87',
:                'hex': '22002044c55c1da36a576217259c3bc21b0c3943f7eb3ff4e3c381d9fd3502434b9e87'},
:  'sequence': 4294967295,
:  'txid': 'd80ff02d0d9eb2da8c8a1c47ab099901f447dd197e34220ea13eca72d7d6d21d',
:  'txinwitness': ['',
:                  '304402202c3f94e5daf4057377d9f16d45b57e962de42fb42cb7e95a0382b7c66624980a02204098f6acd43b0391ea1b4a8102797e78895848fb7e883f98d207d14d45945a6901',
:                  '30440220448460edd5291a548c571ccf3a72caf47b02364035dc84f420d311e3a0c5494802205bb1cc89f20dc1e2c1f6eadb74898f8eecc46fbf488b676636b45fafaeb96e0f01',
:                  '5221021e6617e06bb90f621c3800e8c37ab081a445ae5527f6c5f68a022e7133f9b5fe2103bea1a8ce6369435bb74ff1584a136a7efeebfe4bc320b4d59113c92acd869f38210280631b27700baf7d472483fadfe1c4a7340a458f28bf6bae5d3234312d684c6553ae'],
:  'vout': 154}
